"""Множества (set)"""

"""Множество - набор неупорядоченных (НЕТ ИНДЕКСОВ) уникальных значений (неизменяемых объектов)"""
# элементами множества могут быть все переменные и кортеж
# структура данных множества (и словарей тоже) – хэш-таблица – это структура данных, которая хранит пары «ключ — значение»
# и позволяет очень быстро находить, добавлять и удалять элементы
# ТО: самая медленная коллекция список, потом кортеж, самая быстрая множество (и словари)
# [] - список
# () - кортеж
# {} - множество

# ls = [22, 33, 44, 33] # пустой список
# st = set(ls) #множество из списка
# st = {22, 33, 44, 33} # выведет {33, 44, 22}
# print(st)
# st.clear() # любую коллекцию можно очистить еомандой clear
# print(st)

# добавить
# st.add(42) # в рандомное место
# st.update({'old', 32}) # ожидает КОЛЛЕКЦИЮ: если добавлять строку, то она распадется на отдельные символы
# print(st)
# удалить
# n = st.pop() # удалит символ, который будет в этот момент первым
# st.remove('old') # если указанного на уделние объекта не будет, выдаст ОШИБКУ
# st.discard(42) # если объект существует во множестве, то метод discard его удалит, если объекта не существует, то ошибки НЕ будет
# print(st, n)

# try:
#    n = int(input('> '))
# except ValueError as err:
#     print(err)

# try:
#    st.remove('old')
#    n = int(input('> '))
#    if n == 100:
#        raise TypeError('Ошибка типа данных')
# except KeyError as err:
#     print('Key err', err)
# except ValueError as err:
#     print(err)
# except Exception as err:
#     print(err)
# else:
#     print('ok')
# finally:
#     print('Всегда')

st1 = {1, 2, 33}
st2 = {1, 2, 44}
# объединение множеств
# res = st1.union(st2)
# res = st1 | st2

# пересечение множеств
# res = st1.intersection(st2)
# res = st1 & st2

# вычитание / различие
# res = st1.difference(st2) # удаляем из первого множества пересечения со вторым множеством
# res = st1 - st2


# res = st1.symmetric_difference(st2) # симметрическая разница – только различные элементы множеств (отличия)
# res = st1 ^ st2

# print(res)

st3 = {1, 2} # входит и в первое, и во второе множество
# множества первое и второе по отношению к третьему являются супермножествами
print(st3.issubset(st1))
print(st1.issuperset(st3))


