""""Словарь (dict)"""
"""Словарь – набор неупорядоченных пар (ключ: значение), в котором ключи уникальны"""

d = {}
d = {'Pb': 'свинец', 'Au': 'Золото'}

print(d['Au']) # если ключ существует! Если ключа не существует, выдаст ошибку
print(d.get('Pbg', 'Нужный объект')) # не выдаст ошибку, даже если ключа не существует
print(d)
d['Pb'] = 'Свинец' # измменяем значение ключа
d['Fe'] = 'Железо' #присваем значение ключу, которого нет = добавляем пару
print(d['Pb'])

d.setdefault(2, 222) # 22 игнорируется, потому что у 'Pb' уже есть значение
d.setdefault('H', 'Водород') # создает новую пару
# n = d.setdefault('H')     # возвращет существующее значение
print(d)
key = 'Pb'
print(d[key])
d.update({3:33, 2:222}) # присваивает новое значение, если есть ключ; добавляет пару, если ключа нет
print(d)

# удаление из словаря
n = d.pop(key) # n = d.pop('Pb')
nn = d.popitem() # удаляет последнюю добавленную пару
print(n)
print(d)
print(nn)

print(list(d.keys())) # = print(list(d))
print(list(d.values()))
print(list(d.items()))  # список кортежей

for k in d:
    print(k) # перебор по ключам

for v in d.values():
    print(v) # перебор по значениям

for k, v in d.items():
    print(k, v)     # распаковка

l = [22, 33, 44]
dd = dict.fromkeys(l, 'my item') # присваивает одинаковое значение всем ключам в списке
print(dd)

# dict comprehension
dd = {i: i**2 for i in range(10, 20)}
print(dd)

# из списка кортежей всегда можно сделать словарь
ls = [('Au1', 'Золото1'), ('Fe1', 'Железо1'), (22, 2222), ('H1', 'Водород1')]
dd = dict(ls)
print(dd)