l = [22, 33, 44, 55, 99]
"""Циклический свдиг заключается в том,
чтобы все компоненты списка сдвинулись влево: 33 встало на место 22, 44 на 33 и тд"""
temp = l[0]
n = len(l)
# for i in range(len(l) - 1):
for i in range(n - 1):
    l[i] = l[i + 1]
l[-1] = temp
print (l)

#
# l = [22, 33, 44, 55, 99]
# temp = l[-1]
# n = len(l)
# for i in range(n - 1, 0, -1):
#     l[i] = l[i - 1]
# l[0] = temp
# print (l)

"""исключительно для Питона"""
l = [22, 33, 44, 55, 99]
for i in range(n - 1):
    l[i], l[i + 1] = l[i + 1], l[i]

print (l)